stm32-hotspot/STM32WBA-BLE-RunningSpeedAndCadence/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_RunningSpeedAndCadence/STM32_WPAN/App/rscs_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    service2_app.c
  * @author  MCD Application Team
  * @brief   service2_app application definition.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "app_common.h"
#include "app_ble.h"
#include "ll_sys_if.h"
#include "dbg_trace.h"
#include "ble.h"
#include "rscs_app.h"
#include "rscs.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32_timer.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

typedef enum
{
  Rscm_NOTIFICATION_OFF,
  Rscm_NOTIFICATION_ON,
  Scp_INDICATION_OFF,
  Scp_INDICATION_ON,
  /* USER CODE BEGIN Service2_APP_SendInformation_t */

  /* USER CODE END Service2_APP_SendInformation_t */
  RSCS_APP_SENDINFORMATION_LAST
} RSCS_APP_SendInformation_t;

typedef struct
{
  RSCS_APP_SendInformation_t     Rscm_Notification_Status;
  RSCS_APP_SendInformation_t     Scp_Indication_Status;
  /* USER CODE BEGIN Service2_APP_Context_t */
  uint16_t RSCSFChar;
  RSCS_Measurement_Value_t RSCSMChar;
  uint8_t RSCSSLChar;
  RSCS_SCCP_Value_t RSCSSCPChar;
  uint8_t RSCSSCPCccd;
  uint8_t RSCSSCP_InProgress;
  uint8_t CalibrationFailed;
  UTIL_TIMER_Object_t TimerRSCSMeasurement_Id;
  UTIL_TIMER_Object_t TimerRSCSControlPoint_Id;
  /* USER CODE END Service2_APP_Context_t */
  uint16_t              ConnectionHandle;
} RSCS_APP_Context_t;

/* Private defines -----------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define DEFAULT_RSC_MEASUREMENT_INTERVAL                      (1000)  /**< 1s */
#define DEFAULT_RSC_CONTROL_POINT_INTERVAL                    (2000)  /**< 2s */

/* Operational States */
#define UNDETERMINED                                                        0x0F
#define OFF                                                                 0x33
#define STANDBY                                                             0x3C
#define PREPARING                                                           0x55
#define PRIMING                                                             0x5A
#define WAITING                                                             0x66
#define READY                                                               0x96

/* Therapy Control States */
#define STOP_STATE                                                          0x33
#define PAUSE_STATE                                                         0x3C
#define RUN_STATE                                                           0x55

/* SC Control Point */
/* Op Codes */
#define SET_CUMULATIVE_VALUE                                                0x01
#define START_SENSOR_CALIBRATION                                            0x02
#define UPDATE_SENSOR_LOCATION                                              0x03
#define REQUEST_SUPPORTED_SENSOR_LOCATIONS                                  0x04
#define RESPONSE_CODE                                                       0x10
/* Response Op Code */
#define SUCCESS_RESPONSE                                                    0x01
#define OP_CODE_NOT_SUPPORTED                                               0x02
#define INVALID_OPERAND                                                     0x03
#define OPERATION_FAILED                                                    0x04
#define CCCD_IMPROPERLY_CONFIGURED                                          0x81
#define PROCEDURE_ALLREADY_IN_PROGRESS                                      0x80
/* Sensor Location */
#define TOP_OF_SHOE                                                         0x01
#define IN_SHOE                                                             0x02
#define HIP                                                                 0x03
#define FRONT_WHEEL                                                         0x04
#define LEFT_CRANK                                                          0x05
#define RIGHT_CRANK                                                         0x06
#define LEFT_PEDAL                                                          0x07
#define RIGHT_PEDAL                                                         0x08
#define FRONT_HUB                                                           0x09
#define REAR_DROPOUT                                                        0x0A
#define CHAINSTAY                                                           0x0B
#define REAR_WHEEL                                                          0x0C
#define REAR_HUB                                                            0x0D
#define CHEST                                                               0x0E
#define SPIDER                                                              0x0F
#define CHAIN_RING                                                          0x10
/* USER CODE END PD */

/* External variables --------------------------------------------------------*/
/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
static RSCS_APP_Context_t RSCS_APP_Context;

uint8_t a_RSCS_UpdateCharData[247];

/* USER CODE BEGIN PV */
static uint8_t a_RSCS_SensorLocationList[16] =
{
  TOP_OF_SHOE, IN_SHOE, HIP, CHEST, 
  0,0,0,0,0,0,0,0,0,0,0,0
};

/* USER CODE END PV */

