stm32-hotspot/STM32WBA-BLE-RunningSpeedAndCadence/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_RunningSpeedAndCadence/STM32_WPAN/App/rscs_app.c
/* Private function prototypes -----------------------------------------------*/
static void RSCS_Rscm_SendNotification(void);
static void RSCS_Scp_SendIndication(void);

/* USER CODE BEGIN PFP */
static tBleStatus RSCS_Scp_SendResponseCode(uint8_t Opcode, uint8_t responseCode);
static void RSCS_Rscm_MeasurementTimCb(void *arg);
static uint32_t RSCS_ReadRTCSSRSS ( void );
static void RSCS_Rscm_Measurement(void);
static void RSCS_Scp_EndControlPointTimCb(void *arg);
static void RSCS_Scp_EndControlPoint(void);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void RSCS_Notification(RSCS_NotificationEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service2_Notification_1 */

  /* USER CODE END Service2_Notification_1 */
  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service2_Notification_Service2_EvtOpcode */

    /* USER CODE END Service2_Notification_Service2_EvtOpcode */

    case RSCS_RSCM_NOTIFY_ENABLED_EVT:
      /* USER CODE BEGIN Service2Char1_NOTIFY_ENABLED_EVT */
      {
        LOG_INFO_APP("RSC Measurement Notification enabled\r\n");
        UTIL_TIMER_Stop(&RSCS_APP_Context.TimerRSCSMeasurement_Id);
        UTIL_TIMER_StartWithPeriod(&RSCS_APP_Context.TimerRSCSMeasurement_Id, DEFAULT_RSC_MEASUREMENT_INTERVAL);
      }
      /* USER CODE END Service2Char1_NOTIFY_ENABLED_EVT */
      break;

    case RSCS_RSCM_NOTIFY_DISABLED_EVT:
      /* USER CODE BEGIN Service2Char1_NOTIFY_DISABLED_EVT */
      {
        LOG_INFO_APP("RSC Measurement Notification disabled\r\n");
        UTIL_TIMER_Stop(&RSCS_APP_Context.TimerRSCSMeasurement_Id);
      }
      /* USER CODE END Service2Char1_NOTIFY_DISABLED_EVT */
      break;

    case RSCS_RSCF_READ_EVT:
      /* USER CODE BEGIN Service2Char2_READ_EVT */

      /* USER CODE END Service2Char2_READ_EVT */
      break;

    case RSCS_SEL_READ_EVT:
      /* USER CODE BEGIN Service2Char3_READ_EVT */

      /* USER CODE END Service2Char3_READ_EVT */
      break;

    case RSCS_SCP_WRITE_EVT:
      /* USER CODE BEGIN Service2Char4_WRITE_EVT */

      /* USER CODE END Service2Char4_WRITE_EVT */
      break;

    case RSCS_SCP_INDICATE_ENABLED_EVT:
      /* USER CODE BEGIN Service2Char4_INDICATE_ENABLED_EVT */
      {
        LOG_INFO_APP("SC Control Point Indication enabled\r\n");
        RSCS_APP_Context.RSCSSCPCccd = Scp_INDICATION_ON;
      }
      /* USER CODE END Service2Char4_INDICATE_ENABLED_EVT */
      break;

    case RSCS_SCP_INDICATE_DISABLED_EVT:
      /* USER CODE BEGIN Service2Char4_INDICATE_DISABLED_EVT */
      {
        LOG_INFO_APP("SC Control Point Indication disabled\r\n");
        RSCS_APP_Context.RSCSSCPCccd = Scp_INDICATION_OFF;
      }
      /* USER CODE END Service2Char4_INDICATE_DISABLED_EVT */
      break;

    default:
      /* USER CODE BEGIN Service2_Notification_default */

      /* USER CODE END Service2_Notification_default */
      break;
  }
  /* USER CODE BEGIN Service2_Notification_2 */

  /* USER CODE END Service2_Notification_2 */
  return;
}

void RSCS_APP_EvtRx(RSCS_APP_ConnHandleNotEvt_t *p_Notification)
{
  /* USER CODE BEGIN Service2_APP_EvtRx_1 */

  /* USER CODE END Service2_APP_EvtRx_1 */

  switch(p_Notification->EvtOpcode)
  {
    /* USER CODE BEGIN Service2_APP_EvtRx_Service2_EvtOpcode */

    /* USER CODE END Service2_APP_EvtRx_Service2_EvtOpcode */
    case RSCS_CONN_HANDLE_EVT :
      /* USER CODE BEGIN Service2_APP_CONN_HANDLE_EVT */

      /* USER CODE END Service2_APP_CONN_HANDLE_EVT */
      break;

    case RSCS_DISCON_HANDLE_EVT :
      /* USER CODE BEGIN Service2_APP_DISCON_HANDLE_EVT */
      {
        UTIL_TIMER_Stop(&RSCS_APP_Context.TimerRSCSMeasurement_Id);
        RSCS_APP_Context.RSCSSCP_InProgress = 0;
        RSCS_APP_Context.RSCSMChar.Flags = NO_RSCSM_FLAG;
        RSCS_APP_Context.RSCSMChar.Flags = INSTANTANEOUS_STRIDE_LENGTH_PRESENT |
                                           TOTAL_DISTANCE_PRESENT;
        RSCS_APP_Context.RSCSMChar.InstantaneousCadence = 0;
        RSCS_APP_Context.RSCSMChar.InstantaneousSpeed = 0;
        RSCS_APP_Context.RSCSMChar.InstantaneousStrideLength = 0;
        RSCS_APP_Context.RSCSMChar.TotalDistance = 0;
      }
      /* USER CODE END Service2_APP_DISCON_HANDLE_EVT */
      break;

    default:
      /* USER CODE BEGIN Service2_APP_EvtRx_default */

      /* USER CODE END Service2_APP_EvtRx_default */
      break;
  }

  /* USER CODE BEGIN Service2_APP_EvtRx_2 */

  /* USER CODE END Service2_APP_EvtRx_2 */

  return;
}

void RSCS_APP_Init(void)
{
  UNUSED(RSCS_APP_Context);
  RSCS_Init();

  /* USER CODE BEGIN Service2_APP_Init */
  RSCS_Data_t msg_conf;
  uint8_t length = 0;
  
  /* RSCS Feature */
  RSCS_APP_Context.RSCSFChar = NO_FEATURE;
  RSCS_APP_Context.RSCSFChar = INSTANTANEOUS_STRIDE_LENGTH_MEASUREMENT_SUPORTED |
                               TOTAL_DISTANCE_MEASUREMENT_SUPPORTED |
                               WARNING_OR_RUNNING_STATUS_SUPPORTED |
                               CALIBRATION_PROCEDURE_SUPPORTED |
                               MULTIPLE_SENSOR_LOCATIONS_SUPPORTED;

  a_RSCS_UpdateCharData[length++] =  (RSCS_APP_Context.RSCSFChar) & 0xFF;
  a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSFChar) >> 8) & 0xFF;
  msg_conf.Length = length;
  msg_conf.p_Payload = a_RSCS_UpdateCharData;
  RSCS_UpdateValue(RSCS_RSCF, &msg_conf);
  
  /* RSCS Measurement */
  RSCS_APP_Context.RSCSMChar.Flags = NO_RSCSM_FLAG;
  RSCS_APP_Context.RSCSMChar.Flags = INSTANTANEOUS_STRIDE_LENGTH_PRESENT |
                                     TOTAL_DISTANCE_PRESENT;
  RSCS_APP_Context.RSCSMChar.InstantaneousCadence = 0;
  RSCS_APP_Context.RSCSMChar.InstantaneousSpeed = 0;
  RSCS_APP_Context.RSCSMChar.InstantaneousStrideLength = 0;
  RSCS_APP_Context.RSCSMChar.TotalDistance = 0;
  
  length = 0;
  a_RSCS_UpdateCharData[length++] =   RSCS_APP_Context.RSCSMChar.Flags;
  a_RSCS_UpdateCharData[length++] =  (RSCS_APP_Context.RSCSMChar.InstantaneousSpeed) & 0xFF;
  a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSMChar.InstantaneousSpeed) >> 8) & 0xFF;
  a_RSCS_UpdateCharData[length++] =   RSCS_APP_Context.RSCSMChar.InstantaneousCadence;
  a_RSCS_UpdateCharData[length++] =  (RSCS_APP_Context.RSCSMChar.InstantaneousStrideLength) & 0xFF;
  a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSMChar.InstantaneousStrideLength) >> 8) & 0xFF;
  a_RSCS_UpdateCharData[length++] =  (RSCS_APP_Context.RSCSMChar.TotalDistance) & 0xFF;
  a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSMChar.TotalDistance) >> 8) & 0xFF;
  a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSMChar.TotalDistance) >> 16) & 0xFF;
  a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSMChar.TotalDistance) >> 24) & 0xFF;
  msg_conf.Length = length;
  msg_conf.p_Payload = a_RSCS_UpdateCharData;
  RSCS_UpdateValue(RSCS_RSCM, &msg_conf);
  
  /* RSCS Sensor Location */
  RSCS_APP_Context.RSCSSLChar = TOP_OF_SHOE;

  length = 0;
  a_RSCS_UpdateCharData[length++] =   RSCS_APP_Context.RSCSSLChar;
  msg_conf.Length = length;
  msg_conf.p_Payload = a_RSCS_UpdateCharData;
  RSCS_UpdateValue(RSCS_SEL, &msg_conf);

