stm32-hotspot/STM32WBA-BLE-RunningSpeedAndCadence/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_RunningSpeedAndCadence/STM32_WPAN/App/rscs_app.c
  /* RSCS Control Point Indication disabled */
  RSCS_APP_Context.RSCSSCPCccd = Scp_INDICATION_OFF;
  
  /* RSCS Control Point proccess in progress */
  RSCS_APP_Context.RSCSSCP_InProgress = 0;

  /* Sensor Calibration Success */
  RSCS_APP_Context.CalibrationFailed = 0;
  
  /**
   * Register task for RSCS Measurement
   */
  UTIL_SEQ_RegTask( 1<< CFG_TASK_RSCS_MEAS_REQ_ID, UTIL_SEQ_RFU, RSCS_Rscm_Measurement);

  /**
   * Create timer for RSCS Measurement
   */
  UTIL_TIMER_Create(&(RSCS_APP_Context.TimerRSCSMeasurement_Id), DEFAULT_RSC_MEASUREMENT_INTERVAL, UTIL_TIMER_PERIODIC, RSCS_Rscm_MeasurementTimCb, 0);

  /**
   * Register task for End Sensor Calibration
   */
  UTIL_SEQ_RegTask( 1<< CFG_TASK_RSCS_END_CONTROL_POINT_REQ_ID, UTIL_SEQ_RFU, RSCS_Scp_EndControlPoint);

  /**
   * Create timer for Sensor Calibration
   */
  UTIL_TIMER_Create(&(RSCS_APP_Context.TimerRSCSControlPoint_Id), DEFAULT_RSC_CONTROL_POINT_INTERVAL, UTIL_TIMER_ONESHOT, RSCS_Scp_EndControlPointTimCb, 0);

  /* USER CODE END Service2_APP_Init */
  return;
}

/* USER CODE BEGIN FD */
/**
* @brief SCP request handler 
* @param requestData: pointer to received SCP request data
* @param requestDataLength: received SCP request length
* @retval None
*/
void RSCS_APP_SCCPRequestHandler(uint8_t * pRequestData, uint8_t requestDataLength)
{
  uint8_t OpCode = pRequestData[0];

  RSCS_APP_Context.RSCSSCPChar.OpCode = OpCode;
  
  /* Check and Process the OpCode */
  switch(OpCode)
  {
    case SET_CUMULATIVE_VALUE:
      {
        LOG_INFO_APP("SET_CUMULATIVE_VALUE\r\n");

        LOG_INFO_APP("requestDataLength\r\n", requestDataLength);
        for(uint8_t i = 0; i < requestDataLength; i++)
        {
          LOG_INFO_APP("pRequestData[%d] = 0x%x\r\n", i, pRequestData[i]);
        }
        
        /* Stop RSC Measurement */
        UTIL_TIMER_Stop(&RSCS_APP_Context.TimerRSCSMeasurement_Id);
          
        if(((RSCS_APP_Context.RSCSMChar.Flags) & TOTAL_DISTANCE_MEASUREMENT_SUPPORTED) == TOTAL_DISTANCE_MEASUREMENT_SUPPORTED )
        {
          /* Set Total Distance to cumulative value */
          RSCS_APP_Context.RSCSMChar.TotalDistance = pRequestData[1]         |
                                                     (pRequestData[2] << 8)  |
                                                     (pRequestData[3] << 16) |
                                                     (pRequestData[4] << 24);

          RSCS_APP_Context.RSCSSCPChar.response = SUCCESS_RESPONSE;
        }
        else
        {
          LOG_INFO_APP("OPERATION FAILED\r\n");
          RSCS_APP_Context.RSCSSCPChar.response = OPERATION_FAILED;
        }
        RSCS_APP_Context.RSCSSCP_InProgress = 1;
        UTIL_TIMER_StartWithPeriod(&RSCS_APP_Context.TimerRSCSControlPoint_Id, DEFAULT_RSC_CONTROL_POINT_INTERVAL);
      }
      break;
                      
    case START_SENSOR_CALIBRATION:
      {
        /* Stop RSC Measurement */
        UTIL_TIMER_Stop(&RSCS_APP_Context.TimerRSCSMeasurement_Id);
          
        if(((RSCS_APP_Context.RSCSFChar) & CALIBRATION_PROCEDURE_SUPPORTED) == CALIBRATION_PROCEDURE_SUPPORTED )
        {
          RSCS_APP_Context.RSCSSCPChar.response = SUCCESS_RESPONSE;
          LOG_INFO_APP("START_SENSOR_CALIBRATION\r\n");
          LOG_INFO_APP("SUCCESS\r\n");
        }
        else
        {
          LOG_INFO_APP("OPERATION FAILED\r\n");
          RSCS_APP_Context.RSCSSCPChar.response = OPERATION_FAILED;
        }
        RSCS_APP_Context.RSCSSCP_InProgress = 1;
        UTIL_TIMER_StartWithPeriod(&RSCS_APP_Context.TimerRSCSControlPoint_Id, DEFAULT_RSC_CONTROL_POINT_INTERVAL);
      }
      break;
                      
    case UPDATE_SENSOR_LOCATION:
      {
        /* Stop RSC Measurement */
        UTIL_TIMER_Stop(&RSCS_APP_Context.TimerRSCSMeasurement_Id);
          
        if(((RSCS_APP_Context.RSCSFChar) & MULTIPLE_SENSOR_LOCATIONS_SUPPORTED) == MULTIPLE_SENSOR_LOCATIONS_SUPPORTED )
        {
          if(pRequestData[1] <= CHAIN_RING)
          {
            RSCS_Data_t msg_conf;
            uint8_t length = 0;
            
            LOG_INFO_APP("UPDATE_SENSOR_LOCATION\r\n");
            
            RSCS_APP_Context.RSCSSLChar = pRequestData[1];
            
            while((length < 16)                           &&
                  (a_RSCS_SensorLocationList[length] > 0) &&
                  (a_RSCS_SensorLocationList[length] != RSCS_APP_Context.RSCSSLChar))
            {
              length++;
            }
            if(a_RSCS_SensorLocationList[length] == 0)
            {
              a_RSCS_SensorLocationList[length] = RSCS_APP_Context.RSCSSLChar;
            }
                   
            length = 0;
            a_RSCS_UpdateCharData[length++] = RSCS_APP_Context.RSCSSLChar;
            msg_conf.Length = length;
            msg_conf.p_Payload = a_RSCS_UpdateCharData;
            RSCS_UpdateValue(RSCS_SEL, &msg_conf);
            
            RSCS_APP_Context.RSCSSCPChar.response = SUCCESS_RESPONSE;
            LOG_INFO_APP("SUCCESS\r\n");
          }
          else
          {
            LOG_INFO_APP("INVALID PARAMETER\r\n");
            RSCS_APP_Context.RSCSSCPChar.response = INVALID_OPERAND;
          }
        }
        else
        {
          LOG_INFO_APP("OPERATION FAILED\r\n");
          RSCS_APP_Context.RSCSSCPChar.response = OPERATION_FAILED;
        }
        RSCS_APP_Context.RSCSSCP_InProgress = 1;
        UTIL_TIMER_StartWithPeriod(&RSCS_APP_Context.TimerRSCSControlPoint_Id, DEFAULT_RSC_CONTROL_POINT_INTERVAL);
      }
      break;
                      
    case REQUEST_SUPPORTED_SENSOR_LOCATIONS:
      {
        if(((RSCS_APP_Context.RSCSFChar) & MULTIPLE_SENSOR_LOCATIONS_SUPPORTED) == MULTIPLE_SENSOR_LOCATIONS_SUPPORTED )
        {
          RSCS_APP_Context.RSCSSCPChar.response = SUCCESS_RESPONSE;
        }
        else
        {
          LOG_INFO_APP("OPERATION FAILED\r\n");
          RSCS_APP_Context.RSCSSCPChar.response = OPERATION_FAILED;
        }
        RSCS_APP_Context.RSCSSCP_InProgress = 1;
        UTIL_TIMER_StartWithPeriod(&RSCS_APP_Context.TimerRSCSControlPoint_Id, DEFAULT_RSC_CONTROL_POINT_INTERVAL);
      }
      break;
                      
    default:
      {
        LOG_INFO_APP("OP CODE NOT SUPPORTED\r\n");
        RSCS_APP_Context.RSCSSCPChar.response = OP_CODE_NOT_SUPPORTED;
        RSCS_APP_Context.RSCSSCP_InProgress = 1;
        UTIL_TIMER_StartWithPeriod(&RSCS_APP_Context.TimerRSCSControlPoint_Id, DEFAULT_RSC_CONTROL_POINT_INTERVAL);
      }
      break;
  }
} /* end of IDS_SRCP_RequestHandler() */

/**
* @brief SCP request check
* @param [in] requestData: pointer to received SCP request data
* @param [in] requestDataLength: received SCP request length
* @retval 0x00 when no error, error code otherwise
*/
uint8_t RSCS_APP_SCCPCheckRequestValid(uint8_t * pRequestData, uint8_t requestDataLength)
{
  uint8_t retval = 0x00;
  
  LOG_INFO_APP("SCP Request %d, request data length: %d\r\n", pRequestData[0], requestDataLength);
  
  if (RSCS_APP_Context.RSCSSCPCccd != Scp_INDICATION_ON)
  {
    retval = CCCD_IMPROPERLY_CONFIGURED;
  }
  else if(RSCS_APP_Context.RSCSSCP_InProgress)
  {
    retval = PROCEDURE_ALLREADY_IN_PROGRESS;
  }
  
  return retval;
} /* end of CGMS_RACP_CheckRequestValid() */

