stm32-hotspot/STM32WBA-BLE-RunningSpeedAndCadence/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_RunningSpeedAndCadence/STM32_WPAN/App/rscs_app.c
void RSCS_APP_SCCPIndicationReceived(void)
{
  RSCS_APP_Context.RSCSSCP_InProgress = 0;

  /* Start RSC Measurement updates */
  UTIL_TIMER_StartWithPeriod(&RSCS_APP_Context.TimerRSCSMeasurement_Id, DEFAULT_RSC_MEASUREMENT_INTERVAL);
}

void RSCS_APP_SCCPCalibrationFailed(void)
{
  RSCS_APP_Context.CalibrationFailed = 1; /* Sensor Calibration Failed */  
}
/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
__USED void RSCS_Rscm_SendNotification(void) /* Property Notification */
{
  RSCS_APP_SendInformation_t notification_on_off = Rscm_NOTIFICATION_OFF;
  RSCS_Data_t rscs_notification_data;

  rscs_notification_data.p_Payload = (uint8_t*)a_RSCS_UpdateCharData;
  rscs_notification_data.Length = 0;

  /* USER CODE BEGIN Service2Char1_NS_1*/

  /* USER CODE END Service2Char1_NS_1*/

  if (notification_on_off != Rscm_NOTIFICATION_OFF)
  {
    RSCS_UpdateValue(RSCS_RSCM, &rscs_notification_data);
  }

  /* USER CODE BEGIN Service2Char1_NS_Last*/

  /* USER CODE END Service2Char1_NS_Last*/

  return;
}

__USED void RSCS_Scp_SendIndication(void) /* Property Indication */
{
  RSCS_APP_SendInformation_t indication_on_off = Scp_INDICATION_OFF;
  RSCS_Data_t rscs_indication_data;

  rscs_indication_data.p_Payload = (uint8_t*)a_RSCS_UpdateCharData;
  rscs_indication_data.Length = 0;

  /* USER CODE BEGIN Service2Char4_IS_1*/

  /* USER CODE END Service2Char4_IS_1*/

  if (indication_on_off != Scp_INDICATION_OFF)
  {
    RSCS_UpdateValue(RSCS_SCP, &rscs_indication_data);
  }

  /* USER CODE BEGIN Service2Char4_IS_Last*/

  /* USER CODE END Service2Char4_IS_Last*/

  return;
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS*/
static void RSCS_Scp_EndControlPointTimCb(void *arg)
{
  /**
   * The code shall be executed in the background as aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask(1<<CFG_TASK_RSCS_END_CONTROL_POINT_REQ_ID, CFG_SEQ_PRIO_0);

  return;
}

static void RSCS_Rscm_MeasurementTimCb(void *arg)
{
  /**
   * The code shall be executed in the background as aci command may be sent
   * The background is the only place where the application can make sure a new aci command
   * is not sent if there is a pending one
   */
  UTIL_SEQ_SetTask(1<<CFG_TASK_RSCS_MEAS_REQ_ID, CFG_SEQ_PRIO_0);

  return;
}

static uint32_t RSCS_ReadRTCSSRSS ( void )
{
  return ((uint32_t) (((READ_REG(RTC->SSR) & 0x0E00) >> 9) + 65));
}

/**
* @brief End of Sensor calibration
* @param None
* @retval None
*/
static void RSCS_Scp_EndControlPoint(void)
{
  RSCS_Scp_SendResponseCode(RSCS_APP_Context.RSCSSCPChar.OpCode, RSCS_APP_Context.RSCSSCPChar.response);
}

/**
* @brief Update RSC Measurement char
* @param None
* @retval None
*/
static void RSCS_Rscm_Measurement(void)
{
  RSCS_Data_t msg_conf;
  uint8_t length = 0;

  a_RSCS_UpdateCharData[length++] =   RSCS_APP_Context.RSCSMChar.Flags;
  a_RSCS_UpdateCharData[length++] =  (RSCS_APP_Context.RSCSMChar.InstantaneousSpeed) & 0xFF;
  a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSMChar.InstantaneousSpeed) >> 8) & 0xFF;
  a_RSCS_UpdateCharData[length++] =   RSCS_APP_Context.RSCSMChar.InstantaneousCadence;
  if(((RSCS_APP_Context.RSCSMChar.Flags) & INSTANTANEOUS_STRIDE_LENGTH_PRESENT) == INSTANTANEOUS_STRIDE_LENGTH_PRESENT )
  {
    a_RSCS_UpdateCharData[length++] =  (RSCS_APP_Context.RSCSMChar.InstantaneousStrideLength) & 0xFF;
    a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSMChar.InstantaneousStrideLength) >> 8) & 0xFF;
  }
  if(((RSCS_APP_Context.RSCSMChar.Flags) & TOTAL_DISTANCE_MEASUREMENT_SUPPORTED) == TOTAL_DISTANCE_MEASUREMENT_SUPPORTED )
  {
    a_RSCS_UpdateCharData[length++] =  (RSCS_APP_Context.RSCSMChar.TotalDistance) & 0xFF;
    a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSMChar.TotalDistance) >> 8) & 0xFF;
    a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSMChar.TotalDistance) >> 16) & 0xFF;
    a_RSCS_UpdateCharData[length++] = ((RSCS_APP_Context.RSCSMChar.TotalDistance) >> 24) & 0xFF;
  }
  msg_conf.Length = length;
  msg_conf.p_Payload = a_RSCS_UpdateCharData;
  RSCS_UpdateValue(RSCS_RSCM, &msg_conf);

  RSCS_APP_Context.RSCSMChar.InstantaneousCadence += 10;
  
  RSCS_APP_Context.RSCSMChar.Flags = NO_RSCSM_FLAG;
  RSCS_APP_Context.RSCSMChar.Flags = INSTANTANEOUS_STRIDE_LENGTH_PRESENT |
                                     TOTAL_DISTANCE_PRESENT;
  if(RSCS_APP_Context.RSCSMChar.InstantaneousCadence > 60)
  {
    /* Running status */
    RSCS_APP_Context.RSCSMChar.Flags |= RUNNING_STATUS;
    LOG_INFO_APP("Running Status\r\n");
  }
  
  RSCS_APP_Context.RSCSMChar.InstantaneousSpeed = ((RSCS_ReadRTCSSRSS()) & 0xFF) |
                                                  (((RSCS_ReadRTCSSRSS()) >> 8) & 0xFF);
  if(((RSCS_APP_Context.RSCSMChar.Flags) & INSTANTANEOUS_STRIDE_LENGTH_PRESENT) == INSTANTANEOUS_STRIDE_LENGTH_PRESENT )
  {
    RSCS_APP_Context.RSCSMChar.InstantaneousStrideLength = ((RSCS_ReadRTCSSRSS()) & 0xFF) |
                                                           (((RSCS_ReadRTCSSRSS()) >> 8) & 0xFF);
  }
  if(((RSCS_APP_Context.RSCSMChar.Flags) & TOTAL_DISTANCE_MEASUREMENT_SUPPORTED) == TOTAL_DISTANCE_MEASUREMENT_SUPPORTED )
  {
    /* Total Distance is updated only if supported and no Control Point Set Cumulative process in progress */
    RSCS_APP_Context.RSCSMChar.TotalDistance += RSCS_ReadRTCSSRSS();
  }
  
  return;
}

/**
* @brief Send a SRCP response as consequence of a SRCP request
* @param Opcode: SRCP op code
* @param responseCode: SRCP response code or number of stored records
* @retval None
*/
static tBleStatus RSCS_Scp_SendResponseCode(uint8_t Opcode, uint8_t responseCode)
{
  tBleStatus retval = BLE_STATUS_FAILED;
  RSCS_Data_t msg_conf;
  uint8_t length = 0;

  a_RSCS_UpdateCharData[length++] = RESPONSE_CODE;
  a_RSCS_UpdateCharData[length++] = Opcode;
  if((Opcode == START_SENSOR_CALIBRATION) && (RSCS_APP_Context.CalibrationFailed == 1))
  {
    a_RSCS_UpdateCharData[length++] = OPERATION_FAILED;
    RSCS_APP_Context.CalibrationFailed = 0;
  }
  else
  {
    a_RSCS_UpdateCharData[length++] = responseCode;
  }
  
  if((responseCode == SUCCESS_RESPONSE) &&
     (Opcode == REQUEST_SUPPORTED_SENSOR_LOCATIONS))
  {
    uint8_t index = 0;
    
    while(a_RSCS_SensorLocationList[index] > 0)
    {
      a_RSCS_UpdateCharData[length++] = a_RSCS_SensorLocationList[index];
      index++;
    }
  }
  msg_conf.Length = length;
  msg_conf.p_Payload = a_RSCS_UpdateCharData;
  retval = RSCS_UpdateValue(RSCS_SCP, &msg_conf);
  
  return retval;
} /* end of RSCS_Scp_SendResponseCode() */
/* USER CODE END FD_LOCAL_FUNCTIONS*/
